CongducPham/PEPR_AgriFutur/Arduino_ESP32/Arduino_ESP32_LoRa_SX12XX_test/Arduino_ESP32_LoRa_SX12XX_test.ino
  wakeup_reason = esp_sleep_get_wakeup_cause();

  switch (wakeup_reason) {
    case ESP_SLEEP_WAKEUP_EXT0:     Serial.println("Wakeup caused by external signal using RTC_IO"); break;
    case ESP_SLEEP_WAKEUP_EXT1:     Serial.println("Wakeup caused by external signal using RTC_CNTL"); break;
    case ESP_SLEEP_WAKEUP_TIMER:    Serial.println("Wakeup caused by timer"); break;
    case ESP_SLEEP_WAKEUP_TOUCHPAD: Serial.println("Wakeup caused by touchpad"); break;
    case ESP_SLEEP_WAKEUP_ULP:      Serial.println("Wakeup caused by ULP program"); break;
    default:                        Serial.printf("Wakeup was not caused by deep sleep: %d\n", wakeup_reason); break;
  }
}

void lowPower(unsigned long time_ms) {

  unsigned long waiting_t=time_ms;

   ++bootCount;
  Serial.println("Boot number: " + String(bootCount));
  //Print the wakeup reason for ESP32
  print_wakeup_reason();
  esp_sleep_enable_timer_wakeup(time_ms * mS_TO_uS_FACTOR);//set wake up source
  Serial.println("Setup ESP32 to sleep for every " + String(idlePeriodInMin) + " minutes and " 
              + String(idlePeriodInSec) + " Seconds");
  Serial.println("Going to deep sleep now");
  Serial.flush();
#ifdef LOW_POWER_DEEP_SLEEP  
  esp_deep_sleep_start();
#endif
#ifdef LOW_POWER_LIGHT_SLEEP  
  esp_light_sleep_start();
#endif  
}
#endif

/*****************************
 _____      _               
/  ___|    | |              
\ `--.  ___| |_ _   _ _ __  
 `--. \/ _ \ __| | | | '_ \ 
/\__/ /  __/ |_| |_| | |_) |
\____/ \___|\__|\__,_| .__/ 
                     | |    
                     |_|    
******************************/

#ifdef ARDUINO_ARCH_ASR650X
void onWakeUp() { }
#endif

void setup()
{

  Serial.begin(115200);  
  while(!Serial);//Ensure that the serial port is enabled
  
  // Print a start message
  PRINT_CSTSTR("LoRa + Low Power test for ESP32\n");

// See http://www.nongnu.org/avr-libc/user-manual/using_tools.html
// for the list of define from the AVR compiler

#ifdef ESP32
  PRINT_CSTSTR("ESP32 detected\n");
#endif 
#if defined ARDUINO_Heltec_WIFI_LoRa_32 || defined ARDUINO_WIFI_LoRa_32  || defined HELTEC_LORA
  PRINT_CSTSTR("Heltec WiFi LoRa 32 variant\n");
#endif
#if defined ARDUINO_XIAO_ESP32S3 || defined MY_XIAO_ESP32S3 || defined MY_XIAO_ESP32S3_WIO1262
  PRINT_CSTSTR("XIAO-ESP32S3 variant\n");
#endif
#if defined MY_XIAO_ESP32S3_SENSE
  PRINT_CSTSTR("XIAO-ESP32S3-Sense variant with camera board\n");
#endif
#if defined UPESY_WROOM || defined MY_UPESY_WROOM
  PRINT_CSTSTR("uPESY WROOM variant\n");
#endif
#if defined ESP32_DEV || defined MY_ESP32_CAM
  PRINT_CSTSTR("ESP32-CAM variant\n");
#endif
#if defined ESP32S3_DEV || defined MY_FREENOVE_ESP32S3_CAM
  PRINT_CSTSTR("FREENOVE_ESP32S3_CAM variant\n");
#endif
#if defined MY_FREENOVE_ESP32_CAM_DEV || defined MY_NONAME_ESP32_CAM_DEV
  PRINT_CSTSTR("ESP32_CAM_DEV variant\n");
#endif

#ifdef MY_ESP32_CAM
  SD_MMC.begin("/sdcard", true);
  // 2, 14 and 15 are connected to SD card and cannot be used
  // 4, 12, 13, 16 can be used but for 13, need to put SD card in slow mode SD_MMC.begin("/sdcard", true);
  pinMode(16, OUTPUT);
  pinMode(12, OUTPUT);
  pinMode(13, INPUT);
  pinMode(4, OUTPUT);

  delay(10); // Important delay for some GPIO that need to be 0 at the beginning

  //        SCK, MISO, MOSI, CS/SS 
  SPI.begin(12,  13,   4,   16);
  // TODO: it is still not working :-(
  // seems that it is not possible to use SPI pins that are connected to SD card
  // need to try:
  // https://stuartsprojects.github.io/2022/02/05/Long-Range-Wireless-Adapter-for-ESP32CAM.html
  // MOSI:2 SCK:4 NSS:12 MISO:13 NRESET:15 
#elif defined MY_XIAO_ESP32S3 || defined MY_XIAO_ESP32S3_SENSE
  pinMode(2, OUTPUT); //GPIO 2 = D1
  pinMode(1, OUTPUT); //GPIO 1 = D0
  pinMode(4, INPUT);  //GPIO 4 = D3
  pinMode(5, OUTPUT); //GPIO 5 = D4

  delay(10); 

  //        SCK, MISO, MOSI, CS/SS 
  SPI.begin(1,   4,    5,    2);

#elif defined MY_FREENOVE_ESP32S3_CAM
  pinMode(21, OUTPUT); //GPIO 21 = 21
  pinMode(47, OUTPUT); //GPIO 47 = 47
  pinMode(42, INPUT);  //GPIO 42 = 42
  pinMode(41, OUTPUT); //GPIO 41 = 41

  delay(10); 

  //        SCK, MISO,  MOSI, CS/SS 
  SPI.begin(47,  42,    41,   21);  

#elif MY_FREENOVE_ESP32_CAM_DEV || defined MY_NONAME_ESP32_CAM_DEV
  pinMode(32, OUTPUT);
  pinMode(12, OUTPUT); 
  pinMode(13, INPUT);  
  pinMode(14, OUTPUT);

  delay(10); 

  //        SCK, MISO,  MOSI, CS/SS 
  SPI.begin(12,  13,    14,   32);  

#else
  //start SPI bus communication
  SPI.begin();
#endif

  //setup hardware pins used by device, then check if device is found
#ifdef SX126X
  if (LT.begin(NSS, NRESET, RFBUSY, DIO1, DIO2, DIO3, RX_EN, TX_EN, SW, LORA_DEVICE))
#endif

#ifdef SX127X
  if (LT.begin(NSS, NRESET, DIO0, DIO1, DIO2, LORA_DEVICE))
#endif

#ifdef SX128X
  if (LT.begin(NSS, NRESET, RFBUSY, DIO1, DIO2, DIO3, RX_EN, TX_EN, LORA_DEVICE))
#endif
  {
    PRINT_CSTSTR("LoRa Device found\n");                                  
    delay(1000);
  }
  else
  {
    PRINT_CSTSTR("No device responding\n");
    while (1){ }
  }

/*******************************************************************************************************
  Based from SX12XX example - Stuart Robinson 
*******************************************************************************************************/

  //The function call list below shows the complete setup for the LoRa device using the
  // information defined in the Settings.h file.
  //The 'Setup LoRa device' list below can be replaced with a single function call;
  //LT.setupLoRa(Frequency, Offset, SpreadingFactor, Bandwidth, CodeRate, Optimisation);

  //***************************************************************************************************
  //Setup LoRa device
  //***************************************************************************************************
  //got to standby mode to configure device
  LT.setMode(MODE_STDBY_RC);
#ifdef SX126X
  LT.setRegulatorMode(USE_DCDC);
  LT.setPaConfig(0x04, PAAUTO, LORA_DEVICE);
  LT.setDIO3AsTCXOCtrl(TCXO_CTRL_3_3V);
  LT.calibrateDevice(ALLDevices);                //is required after setting TCXO
  LT.calibrateImage(DEFAULT_CHANNEL);
  LT.setDIO2AsRfSwitchCtrl();
#endif
#ifdef SX128X
  LT.setRegulatorMode(USE_LDO);
#endif
  //set for LoRa transmissions                              
  LT.setPacketType(PACKET_TYPE_LORA);
  //set the operating frequency                 
#ifdef MY_FREQUENCY
  LT.setRfFrequency(MY_FREQUENCY, Offset);
#else  
  LT.setRfFrequency(DEFAULT_CHANNEL, Offset);                   
#endif
//run calibration after setting frequency
#ifdef SX127X
  LT.calibrateImage(0);
#endif
  //set LoRa modem parameters
#if defined SX126X || defined SX127X
  LT.setModulationParams(SpreadingFactor, Bandwidth, CodeRate, Optimisation);
#endif
#ifdef SX128X
  LT.setModulationParams(SpreadingFactor, Bandwidth, CodeRate);
#endif                                     
  //where in the SX buffer packets start, TX and RX
  LT.setBufferBaseAddress(0x00, 0x00);
  //set packet parameters
#if defined SX126X || defined SX127X                     
  LT.setPacketParams(8, LORA_PACKET_VARIABLE_LENGTH, 255, LORA_CRC_ON, LORA_IQ_NORMAL);
#endif
#ifdef SX128X
  LT.setPacketParams(12, LORA_PACKET_VARIABLE_LENGTH, 255, LORA_CRC_ON, LORA_IQ_NORMAL, 0, 0);
#endif
  //syncword, LORA_MAC_PRIVATE_SYNCWORD = 0x12, or LORA_MAC_PUBLIC_SYNCWORD = 0x34 
#if defined SX126X || defined SX127X
#if defined PUBLIC_SYNCWORD || defined LORAWAN
  LT.setSyncWord(LORA_MAC_PUBLIC_SYNCWORD);              
#else
  LT.setSyncWord(LORA_MAC_PRIVATE_SYNCWORD);
#endif
  //set for highest sensitivity at expense of slightly higher LNA current
  LT.setHighSensitivity();  //set for maximum gain
#endif
#ifdef SX126X
  //set for IRQ on TX done and timeout on DIO1
  LT.setDioIrqParams(IRQ_RADIO_ALL, (IRQ_TX_DONE + IRQ_RX_TX_TIMEOUT), 0, 0);
#endif
#ifdef SX127X
  //set for IRQ on RX done
  LT.setDioIrqParams(IRQ_RADIO_ALL, IRQ_TX_DONE, 0, 0);
  LT.setPA_BOOST(PA_BOOST);
#endif
#ifdef SX128X
  LT.setDioIrqParams(IRQ_RADIO_ALL, (IRQ_TX_DONE + IRQ_RX_TX_TIMEOUT), 0, 0);
#endif   

  if (IQ_Setting==LORA_IQ_INVERTED) {
    LT.invertIQ(true);
    PRINT_CSTSTR("Invert I/Q on RX\n");
  }
  else {
    LT.invertIQ(false);
    PRINT_CSTSTR("Normal I/Q\n");
  }  
   
  //***************************************************************************************************

  PRINTLN;
  //reads and prints the configured LoRa settings, useful check
  LT.printModemSettings();                               
  PRINTLN;
  //reads and prints the configured operating settings, useful check
  LT.printOperatingSettings();                           
  PRINTLN;
  PRINTLN;
#if defined SX126X || defined SX127X  
  //print contents of device registers, normally 0x00 to 0x4F
  LT.printRegisters(0x00, 0x4F);
#endif                       
#ifdef SX128X
  //print contents of device registers, normally 0x900 to 0x9FF 
  LT.printRegisters(0x900, 0x9FF);
#endif                         

/*******************************************************************************************************
  End from SX12XX example - Stuart Robinson 
*******************************************************************************************************/

